#include<stdio.h>

void rands(); //자동입력번호출력 함수
void menu();  //메뉴구성 출력 함수
void ifs(int *a); //번호 선택 결과 출력함수
void main() {	
	int i = 0;
	menu();
	while (i < 10) {
		int a;
		scanf("%d", &a);
		ifs(&a);
		i++;
	}


}




void menu() {
	printf("-----------------------------------\n");
	printf("1.구입 로또번호 자동 입력\n");
	printf("2.구입 로또번호 수동 입력\n");
	printf("3.구입 로또번호 파일 입력\n");
	printf("4.로또번호 번호 확인\n");
	printf("-----------------------------------\n");
	printf("5.추첨번호 배당 금액 수동입력\n");
	printf("6.추첨번호 배당 금액 파일 입력\n");
	printf("7.추첨번호 배당 금액 확인\n");
	printf("-----------------------------------\n");
	printf("8.당첨 번호 금액 출력\n");
	printf("9.종료\n");
	printf("-----------------------------------\n\n");


}
void ifs(int *a) {
	
	if (*a == 1) {
		printf("\n-구입한 로또번호(자동)\n");
		printf("-----------------------------------\n");
		rands();
		printf("\n");
	}
	else if (*a == 2) {
		printf("\n-구입한 로또번호(수동)\n");
		printf("-----------------------------------\n");

	}
	else if (*a == 3) {
		printf("\n-구입한 로또번호(파일)\n");
		printf("-----------------------------------\n");
		
	}
	else if (*a == 4) {
		printf("\n-구입한 로또번호(확인)\n");
		printf("-----------------------------------\n");

	}
	else if (*a == 5) {
		printf("-\n");
		printf("-----------------------------------\n");

	}
	else if (*a == 6) {
		printf("-\n");
		printf("-----------------------------------\n");

	}
	else if (*a == 7) {
		printf("-\n");
		printf("-----------------------------------\n");

	}
	else if (*a == 3) {
		printf("-\n");
		printf("-----------------------------------\n");


	}
	else if (*a == 9) {
		printf("-종료\n");
		printf("-----------------------------------\n");
	
		
	}

	
}		  